{
    "examples": [
        {
            "situation": "Сізге SMS келді: «Сіздің картаңыз бұғатталды. Бұғатты ашу үшін сілтемеге өтіңіз: bank-security.kz»",
            "explanation": "⚠️ Бұл фишинг! Банктер картаны бұғаттан шығару үшін ешқашан сілтеме жібермейді. Шынындағы хабарламалар тек банк телефонының нөмірін ғана қамтиды.",
            "tips": [
                "SMS-тен келген сілтемелерге өтпеңіз",
                "Банкке ресми нөмірі бойынша ғана қоңырау шалыңыз",
                "Хабарлама жіберушіні тексеріңіз"
            ]
        },
        {
            "situation": "Әлеуметтік желідегі бейтаныс адам сізге айына 200% кепілдендірілген табыс беретін жоғары табысты инвестициялық жобаны ұсынады",
            "explanation": "💸 Бұл қаржылық пирамида! Шынындағы осындай мөлшердегі табыс жоқ. Сізді алдап, ақшаңызды алуды қалайды.",
            "tips": [
                "Есіңізде болсын: жоғары табыс = жоғары тәуекел",
                "Қаржы компанияларының лицензияларын тексеріңіз",
                "Жылдам табыс кепілдіктеріне сенбеңіз"
            ]
        },
        {
            "situation": "Сізге телефон шалып, банк қызметкері ретінде таныстырады: «Күдікті операция анықталды. Бас тарту үшін SMS-тен келген кодты айтыңыз»",
            "explanation": "📞 Бұл алаяқтық! SMS-тен келген кодтарды ешқашан айтпаңыз - бұл операцияларды растау коды. Алаяқтар ақшаңызды ұрлауы мүмкін.",
            "tips": [
                "SMS-тен келген кодтарды ешкімге айтпаңыз",
                "Банкке өзіңіз қайта қоңырау шалыңыз",
                "Қоңырау соғушының нөмірін тексеріңіз"
            ]
        },
        {
            "situation": "Хабарландырулар сайтында жаңа iPhone-ді бағасының жартысына алдын ала төлеммен сатады",
            "explanation": "🛍️ Бұл алдау! Алаяқтар алдын ала төлем алып, жоғалып кету үшін тартымды ұсыныстар жасайды. Сіз тауарды алмайсыз.",
            "tips": [
                "Сатып алушының қорғанысы бар болғанда ғана сатып алыңыз",
                "Сатып алу кезінде жеке кездесіңіз",
                "Бейтаныс адамдарға алдын ала төлем аудармаңыз"
            ]
        },
        {
            "situation": "«Қолдау қызметінен» «жүйе бұзуына» байланысты карта деректерін жаңарту сұранысы бар email келеді",
            "explanation": "📧 Бұл фишинг! Шынындағы қолдау қызметтері карта деректерін email арқылы ешқашан сұрамайды. Сілтеме жасанды сайтқа бағыттайды.",
            "tips": [
                "Күдікті сайттарда карта деректерін енгізбеңіз",
                "Email жіберушінің мекенжайын тексеріңіз",
                "Деректерді ресми қолданба арқылы ғана жаңартыңыз"
            ]
        }
    ]
}