{
    "examples": [
        {
            "situation": "Вам пришло SMS: «Ваша карта заблокирована. Для разблокировки перейдите по ссылке: bank-security.ru»",
            "explanation": "⚠️ Это фишинг! Банки никогда не отправляют ссылки для разблокировки карт. Настоящие уведомления содержат только номер телефона банка.",
            "tips": [
                "Не переходите по ссылкам из SMS",
                "Звоните в банк только по официальному номеру",
                "Проверяйте отправителя сообщения"
            ]
        },
        {
            "situation": "Незнакомец в соцсетях предлагает высокодоходный инвестиционный проект с гарантированной прибылью 200% в месяц",
            "explanation": "💸 Это финансовые пирамиды! Реальной прибыли таких размеров не существует. Вас хотят обмануть и забрать ваши деньги.",
            "tips": [
                "Помните: высокий доход = высокий риск",
                "Проверяйте лицензии финансовых компаний",
                "Не верьте гарантиям быстрой прибыли"
            ]
        },
        {
            "situation": "Вам звонят и представляются сотрудником банка: «Обнаружена подозрительная операция. Назовите код из SMS для отмены»",
            "explanation": "📞 Это мошенничество! Никогда не сообщайте коды из SMS - это код подтверждения операций. Мошенники могут украсть ваши деньги.",
            "tips": [
                "Не называйте коды из SMS никому",
                "Самостоятельно перезванивайте в банк",
                "Проверяйте номер звонящего"
            ]
        },
        {
            "situation": "На сайте объявлений продают новый iPhone за половину цены с предоплатой",
            "explanation": "🛍️ Это обман! Мошенники создают привлекательные предложения, чтобы получить предоплату и исчезнуть. Товара вы не получите.",
            "tips": [
                "Покупайте только с защитой покупателя",
                "Встречайтесь лично при покупке",
                "Не переводите предоплату незнакомцам"
            ]
        },
        {
            "situation": "Приходит email от «службы поддержки» с просьбой обновить данные карты из-за «взлома системы»",
            "explanation": "📧 Это фишинг! Настоящие службы поддержки никогда не запрашивают данные карт по email. Ссылка ведет на поддельный сайт.",
            "tips": [
                "Не вводите данные карт на подозрительных сайтах",
                "Проверяйте адрес отправителя email",
                "Обновляйте данные только через официальное приложение"
            ]
        }
    ]
}